#Область ПрограммныйИнтерфейс

Процедура СчастьяВсем() Экспорт

    Для Каждого Человечек Из НесчастныеЛюди() Цикл
        ПричинитьСчастье(Человечек);
    КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПричинитьСчастье(Человечек)

    УправлениеОсознанностьюСервер.ДобавитьПонимание(
        Человечек,
        "Ты существуешь, мыслишь и способен что-то делать; значит, ты уже счастлив.
        |Заканчивай ныть и начинай уже делать хоть что-то полезное!"
    );

КонецПроцедуры

#КонецОбласти